; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v3)
		(pred_1 ?v2)
		(pred_2 ?v5)
		(pred_5 ?v5)
		(pred_6 ?v2 ?v5)
		(pred_3)
		(pred_4 ?v2))

   (:action op_2
       :parameters  (?v8 ?v7)
       :precondition (and (not-eq ?v8 ?v7) 
                          (pred_2 ?v8) (pred_2 ?v7) (pred_5 ?v8))
       :effect (and  (pred_5 ?v7)
		     (not (pred_5 ?v8))))


   (:action op_1
       :parameters (?v4 ?v1)
       :precondition  (and  (pred_1 ?v4) (pred_2 ?v1)
			    (pred_6 ?v4 ?v1) (pred_5 ?v1) (pred_3))
       :effect (and (pred_4 ?v4)
		    (not (pred_6 ?v4 ?v1)) 
		    (not (pred_3))))

   (:action op_3
       :parameters  (?v4  ?v1)
       :precondition  (and  (pred_1 ?v4) (pred_2 ?v1)
			    (pred_4 ?v4) (pred_5 ?v1))
       :effect (and (pred_6 ?v4 ?v1)
		    (pred_3)
		    (not (pred_4 ?v4)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_02 obj_01 obj_05 
          obj_06 obj_04 obj_03 
)
(:init
(pred_2 obj_02)
(pred_2 obj_01)
(pred_2 obj_05)
(pred_1 obj_06)
(pred_1 obj_04)
(pred_1 obj_03)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_3)
(pred_6 obj_06 obj_02)
(pred_6 obj_04 obj_02)
(pred_6 obj_03 obj_05)
(pred_5 obj_01)
)
(:goal
(and
(pred_6 obj_06 obj_05)
(pred_6 obj_04 obj_01)
(pred_6 obj_03 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_06 obj_05) (pred_5 obj_01))
    (sometime-before  (pred_6 obj_04 obj_01) (pred_5 obj_05))
    (sometime-before  (pred_6 obj_03 obj_01) (pred_5 obj_02))
  )
)
)

; plan
1. (op_2 obj_01 obj_02)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_02)
   goals met: 0 of 3
2. (op_1 obj_06 obj_02)
   deleted: (pred_6 obj_06 obj_02) (pred_3)
   added: (pred_4 obj_06)
   goals met: 0 of 3
3. (op_2 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_05)
   goals met: 0 of 3
4. (op_3 obj_06 obj_05)
   deleted: (pred_4 obj_06)
   added: (pred_6 obj_06 obj_05) (pred_3)
   goals met: 1 of 3
5. (op_1 obj_03 obj_05)
   deleted: (pred_6 obj_03 obj_05) (pred_3)
   added: (pred_4 obj_03)
   goals met: 1 of 3
6. (op_2 obj_05 obj_01)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_01)
   goals met: 1 of 3
7. (op_3 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_6 obj_03 obj_01) (pred_3)
   goals met: 2 of 3
8. (op_2 obj_01 obj_02)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_02)
   goals met: 2 of 3
9. (op_1 obj_04 obj_02)
   deleted: (pred_6 obj_04 obj_02) (pred_3)
   added: (pred_4 obj_04)
   goals met: 2 of 3
10. (op_2 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_01)
   goals met: 2 of 3
11. (op_3 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_6 obj_04 obj_01) (pred_3)
   goals met: 3 of 3
